BAS BMEKZU Project/src/Documents/ИНАГРО_РасчетУслугХранения/ИНАГРО_РасчетУслугХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_РасчетУслугХранения</name>
  <registerRecords>AccumulationRegister.ИНАГРО_РасчетыПоУслугам</registerRecords>
  <attributes>
    <name>ВидХранения</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасчета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериодаРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДвиженияФормы36</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьХранениеПоФизическомуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Урожай</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыУрожая</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>ДатаРасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Культура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Урожай</name>
      <type>
        <types>CatalogRef.ИНАГРО_ВидыУрожая</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидХранения</name>
      <type>
        <types>CatalogRef.ИНАГРО_ВидыХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КилограммоДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТонноДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТонноМесяцы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Documents/ИНАГРО_РасчетУслугХранения/Forms/ФормаПечать/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Период(Команда)
	
	ПараметрыФормыВыбора = Новый Структура("НачалоХранения, КонецХранения", НачалоХранения, КонецХранения);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыФормыВыбора, Элементы.Период, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачалоХранения = РезультатВыбора.НачалоПериода;
	КонецХранения  = РезультатВыбора.КонецПериода;
		
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураОтборов = Новый Структура;
	СтруктураОтборов.Вставить("НачалоХранения", НачалоХранения);
	СтруктураОтборов.Вставить("КонецХранения",  КонецХранения);
	СтруктураОтборов.Вставить("Урожай",         Урожай);
	СтруктураОтборов.Вставить("Склад",          Склад);
	СтруктураОтборов.Вставить("Номенклатура",   Номенклатура);
	СтруктураОтборов.Вставить("Контрагент",     Контрагент);
	
	ЗаписатьСтруктуруОтборовНаСервере(СтруктураОтборов);
	
	Закрыть(СтруктураОтборов);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьСтруктуруОтборовНаСервере(СтруктураОтборов)
	
	Документы.ИНАГРО_РасчетУслугХранения.ЗаписатьВыбраннуюПечатнуюФорму(СтруктураОтборов);

КонецПроцедуры 

#КонецОбласти
